# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко
# он их придумывает, Вам стоит написать программу. Винни-Пух считает,
# что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе
# стихотворения одинаковое. Фраза может состоять из одного слова, если во фразе
# несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга
# пробелами. Стихотворение  Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”,
# если с ритмом все не в порядке
#
# Пример:
#
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-дам
# **Вывод:** Парам пам-пам


def check_rhythm(poem):
    words = poem.split()
    syllables_count = []

    for word in words:
        syllable_sum = 0
        for letter in word:
            if letter in 'аеёиоуыэюя':
                syllable_sum += 1
        syllables_count.append(syllable_sum)

    return len(syllables_count) == syllables_count.count(syllables_count[0])


poem_str = 'пара-ра-рам рам-пам-папам па-ра-па-дам'
if check_rhythm(poem_str):
    print('Парам пам-пам')
else:
    print('Пам парам')